#+Title: Experience Report: Steps to "Emacs Hyper Notebooks"
#+Author: Joseph Corneli, Raymond Puzio, and Cameron Ray Smith
#+Date: 10 minute talk for EmacsConf 2020 (28 Nov 2020)
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usepackage[utf8x]{inputenc}

** Solution: access maxima via a new “ob-servant” facility

#+begin_src exp :servant maxima-proc :results output org
display2d:false
#+end_src
#+RESULTS:
#+begin_src org
false
#+end_src

#+begin_src exp :servant maxima-proc :results output raw
expand((x+1)^9)
#+end_src
#+RESULTS:
$$x^9+9\,x^8+36\,x^7+84\,x^6+126\,x^5+126\,x^4+84\,x^3+36\,x^2+9\,x+1$$

(*Bonus feature*: notice that we made it do tex output by default.)

